zhouxw0928/STM32/STM32project/10-1 软件I2C读写MPU6050/Hardware/MyI2C.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"


// 软件I2C

// #define SCL_PORT        GPIOB
// #define SCL_PIN         GPIO_Pin_10

// 通过封装函数提升代码的迁移性 更加容易增加延时操作 实现引脚的封装
void MyI2C_W_SCL(uint8_t BitValue)
{
    GPIO_WriteBit(GPIOB, GPIO_Pin_10, (BitAction)BitValue);
    Delay_us(10);
}

void MyI2C_W_SDA(uint8_t BitValue)
{
    GPIO_WriteBit(GPIOB, GPIO_Pin_11, (BitAction)BitValue);
    Delay_us(10);
}

uint8_t MyI2C_R_SDA(void)
{
    uint8_t BitValue;
    BitValue = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_11);
    Delay_us(10);
    return BitValue;
}

void MyI2C_Init(void)
{
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10 | GPIO_Pin_11;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_SetBits(GPIOA, GPIO_Pin_10 | GPIO_Pin_11); // 释放总线 处于空闲状态
}

void MyI2C_Start(void)  // 兼容起始条件和重复起始条件需要先拉高SDA
{
    MyI2C_W_SDA(1);        //执行起始条件 
    MyI2C_W_SCL(1);
    MyI2C_W_SDA(0);
    MyI2C_W_SCL(0);

}

void MyI2C_Stop(void)
{
    MyI2C_W_SDA(0);     // 先确保SDA处于低电平
    MyI2C_W_SCL(1);     // 先释放SCL
    MyI2C_W_SDA(1);
}

void MyI2C_SendByte(uint8_t Byte)
{
    uint8_t i;
    for (i = 0; i < 8; i++)
    {
        MyI2C_W_SDA(Byte & (0x80 >> i));   // 依次从高位放入
        MyI2C_W_SCL(1);         // 从机读数据
        MyI2C_W_SCL(0);
    }
}

uint8_t MyI2C_RecieveByte(void)
{
    uint8_t i, Byte = 0x00;

    MyI2C_W_SDA(1);     // 主机释放SDA 从机放上数据
    for (i =0; i <8; i++)
    {
        MyI2C_W_SCL(1);     // 释放SCL为高电平开始读取
        if (MyI2C_R_SDA() == 1){Byte |= (0x80 >> i);}   // 从最高位开始读
        MyI2C_W_SCL(0);     // 读取完成之后拉低SCL
    }
    return Byte;
}

void MyI2C_SendAck(uint8_t AckBit)  // 发送应答
{
    MyI2C_W_SDA(AckBit);   // 依次从高位放入
    MyI2C_W_SCL(1);         // 从机读数据
    MyI2C_W_SCL(0);
}

uint8_t MyI2C_RecieveAck(void)      // 接收应答
{
    uint8_t AckBit;
    MyI2C_W_SDA(1);     // 主机释放SDA 从机放上数据
    MyI2C_W_SCL(1);     // 释放SCL为高电平开始读取
    AckBit = MyI2C_R_SDA(); // 读取Ack位
    MyI2C_W_SCL(0);     // 读取完成之后拉低SCL
    return AckBit;
}
